app/Models/UtilisateurModel.php

INSERT INTO `utilisateurs` (`nom`, `email`, `mot_de_passe`, `genre`) VALUES ('tonton2', 'tonto21@gmail.com', '$2y$10$EDuCzoj26IbE5tVEbt5qpenqETGp2XEczog6BhwpRJ5Ebttljl6Aq', 'M')
---
    public function register($data){
        return $this->insert($data);