app/Models/WalletModel.php

    public function insertfirsaccount($data){
        return $this->insert($data);
---
INSERT INTO `wallet` (`id_utilisateur`, `solde`, `est_gold`) VALUES (29, 0, 0)